[
 {
   "review": "J. J. Abrams delivers yet another rebooted spectacle that trades on troupes, allusions and enough hype to distract viewers from the quintessential fact that this is just \"A New Hope\" furnished with new special effects."
 },
 {
   "review": "Seriously cannot create a sequel without copying the originals? Should have made your own storylines"
 },
 {
   "review": "Viewed on it's own it showed some promise. However, it's really a remake of the first 2 movies."
 },
 {
   "review": "So much potential. Last good mainline star wars movie. The only sequel movie I can watch and have any enjoyment."
 },
 {
   "review": "A good attempt of a copy and paste"
 },
 {
   "review": "Another cash-grab from Disney. This was literally \"A New Hope\" No original ideas were made. Though bringing back beloved characters, was nostalgic, it was also very lazy. The VFX and nostalgia are the only reason this movie did good."
 },
 {
   "review": "I mean it's alright for what it's worth, but it feels like the plot's been done before and there are so many plot holes"
 },
 {
   "review": "A sort of retelling of the first Star Wars with lots of special effects… did we really need this?"
 },
 {
   "review": "I'm sorry but aside from it being a copy and paste from Episode 4, people need to wake up and see that this is unoriginal and seriously?!!… Rey?…. She's an OP character that has no character build. Finn is god obsessed with Rey and it's cringe. The story could've been better. The only great sequence of this was when Death Star #2 destroys the 5 planets. That's all."
 },
 {
   "review": "The worst part of this film is how it's a near beat for beat remake of Episode 4, yet no one seems to notice nor care. At least Finn is something new and not a discount version of better characters with a neat concept. John Boyega is the primary reason this film gets 1 star instead of half a Star."
 },
 {
   "review": "This is the film that reignited my love of Star Wars. Since I was a child I've loved the Star Wars universe, I'm a product of the Prequel era I grew up and became an adult between trilogies. So for this to be the films Star Wars film to see in the cinema as an adult it was a truly magical experience."
 },
 {
   "review": "The Force Awakens manages to balance recognizable ingredients from the Star Wars recipe with more modern flavors fairly well. The biggest flaws are all the convenient coincidences and the recycled plot elements. Rey as a protagonist doesn't really work that good either."
 },
 {
   "review": "Copy/Paste from A New Hope, but still a lot of fun."
 },
 {
   "review": "Literally just a complete remake of A New Hope. Absolutely awful with no creativity what so ever"
 },
 {
   "review": "2 stars for the visual. For the rest a copy of \"a new hope\".\nA very bad message, while education was in the hart of the first trilogy (4-6). Here is the reality show version. You can be famous without doing anything. No effort is really necessary to become a Jedi or an adult.  Kill your parents, it's their fault if you don't succeed to be good not yours."
 },
 {
   "review": "A remake of episode 4  Ray won the first lightsaber battle after only holding the saber for the first time destroys kylo. She should have lost this battle especially since she learns off of luke in the next film. She should have lost and it would have given these films some stakes and would have gotten the audience right behind her to win the next battle. I wish one day some other company get hold of star wars and remake this movie properly."
 },
 {
   "review": "This movie was just a new hope but with better CGI and worse acting, this movie is nothing special and took away han solos entire character for no good reason."
 },
 {
   "review": "The Force Awakens is more of a reboot than a sequel, closely following the structure of the original 1977 Star Wars film, A New Hope. However, while it may lack originality, it compensates with practical effects, improved combat sequences, and modern CGI. Overall, The Force Awakens stands as a commendable film that should have paved the way for a fantastic trilogy."
 },
 {
   "review": "There were some things I liked but overall, the writers room failed hard on this one."
 },
 {
   "review": "I tried to like it. I watched it 3 times in the theater. I tried to convince myself it was good. Upon much reflection and watching it in conjunction with the disasters that came after, it should have been much better. It doesn't take much of a Star Wars fan to know that this didn't serve anyone. The OT was written badly, but it was earnest in its storytelling and mythos. This was just trite with acting that fell short of what you thought it should be. \n\nThe worst part is the story. I liked Rey, but her powers were ridiculous. The trailer leading into the story made you think there was going to be more than Rey. The story that was hinted at... Finn feeling the force and becoming a Jedi after being a stormtrooper was the story that would have been interesting. Of course, after this movie, any hope of a rebirth of Star Wars was completely destroyed by Rian Johnson in The Last Jedi."
 },
 {
   "review": "And so the mighty Star Wars franchise came back with belated sequel Episode VII led by a new studio and a new director. J.J. Abrams took on the huge project, jumping head first into the ever-tedious challenge of pleasing both die hard fans of the classics and a brand new generation of potential Star Warsians.\n\nThe Force Awakens takes place 30 years after Return Of The Jedi and, while it does prioritize the introduction of fresh characters, it also checks in with some familiar faces. Harrison Ford is back as cocky smuggler Han Solo and so is his furry companion Chewbacca (Peter Mayhew), both showing up about half an hour into the movie and bringing with them some welcome nostalgia.\n\nPrincess Leia (Carrie Fisher), now General Leia Organa, also returns in a smaller capacity and we get a fleeting glimpse at Luke Skywalker (Mark Hamill). Of course, droid favorites C-3PO (Anthony Daniels) and R2-D2 (Kenny Baker) are also present because, let's face it, would it really be a Star Wars movie without them?The immortal text crawl informs us that Luke Skywalker has vanished and The Empire has given birth to The First Order, a new(-ish) totalitarian regime.\n\nBelieve it or not, said regime is also predominantly run by pedantic Cambridge graduates in silly costumes along with an intimidating Darth Vader-style badass, and there's also a Death Star. Resistance pilot Poe Dameron (Oscar Isaac) is given a map to Skywalker by an old friend and, before he is detained by masked baddie Kylo Ren (Adam Driver), he hides it inside adorable droid BB-8 who then wanders desert planet Jakku aimlessly. Eventually, he meets loner scavenger Rey (Daisy Ridley) who protects him. Meanwhile, stormtrooper FN-2187 (aka Finn) realizes he shouldn't be part of the cruel First Order and escapes with Poe's help. They crash land on Jakku and that's how Finn (John Boyega) meets Rey and the adventure truly begins.\n\nThe new characters' individual stories are definitely strong enough to hold this movie together and the characters themselves are certainly more likable than I, for one, ever expected them to be. Other additions like BB-8 and possible Yoda replacement Maz Kanata (voiced by Lupita Nyong'o) are promising also, though Emperor-style villain Supreme Leader Snoke (voiced by Andy Serkis), a ghoulish CGI fellow, doesn't get a chance to impress. J.J. Abrams tells those mini stories really well but we feel, throughout, that there's a lot we're purposely not being told, key elements that will probably only be revealed in upcoming prequels and sequels.\n\nThe bigger story is Star Wars on auto-pilot: this whole Death Star-Resistance-First Order business is a scenario we've seen time and time again and this movie offers nothing all that new there.In fact, I would argue that this is The Force Awakens' main problem. When aiming for nostalgia or familiarity, it tends to instead hit a tired been-there-done-that kind of feel. The parallels with A New Hope have been mentioned by quite a few reviewers and it's true that there's a bit too much of that to the point where one wonders, a little like with Avatar, how this movie was 10 years in the making. Should Disney have taken on George Lucas' all-new ideas after all? Who knows.\n\nThe tone of the film is also unclear as it attempts to be both bright and hopeful but quite dark and depressing as well. Rey and Finn are introduced to us as troubled loners and yet they're cracking jokes pretty quick, the humour taking you out of the movie more than anything else.The main subplot, which involves Kylo Ren and his father, builds to a big event near the end of the movie and that should either please fans or annoy them royally. Whether this final clash was truly earned will depend on its overall impact on the trilogy, but if the aim was to shock then mission accomplished.\n\nAdam Driver does a good job as Ren, I should point out, and it's refreshing to see that we are not just fed a Darth Vader clone. That said, had the First Order been a more valid, interesting threat altogether, with a more interesting plan, that would have helped make Ren more threatening than he is. The film ends in a promising way and it really does make you want to watch what comes next.The Force Awakens is an enjoyable, if flawed, entry into the franchise.\n\nThe film lacks the originality and urgency of the prequels, as well as the freshness and epic scale of the originals. Some things it does right, other things not so much: it's a very hit-and-miss affair but, as a whole, it remains an entertaining blockbuster that's worth a watch.\n\nChewie, we're home... kinda."
 },
 {
   "review": "There could have been a littler better in the story ling in the movie but great story to a great franchies"
 },
 {
   "review": "This Movie is very Uninventive, even with the Nostalgic characters from the Original Trilogy, and even with familiar faces, this is more of a cash grab than a good storytelling movie, the Writing is bad & cheesy, the lightsaber fights are very dull and underwhelming, and the Disney Princess Shtick was actually very bad, there are a few good things about this film, I like the characters of Finn and Poe Dameron those guys were pretty entertaining and funny, and the performances of Captain Phasma and Domhnall Gleeson were very enjoyable, but this movie is just frustratingly predictable, even if Han Solos murder was pretty shocking to some, I was actually upset in a frustrating way... almost everything about this movie is bland and boring, and the visual effects were uninventive and makes the Prequel Trilogy's visual effects look like the 1970s classics"
 },
 {
   "review": "Especially after the next two films one realizes this was a pretty damn good movie."
 },
 {
   "review": "Assisti três vezes, um filme excelente, recomendo a todos, fiquei muito satisfeito!"
 },
 {
   "review": "Recycled but acceptable.  To bad it's not more than what I'd expected."
 },
 {
   "review": "Just a episode 4 reboot with new characters. no creativity, no Character growth"
 },
 {
   "review": "A very fun movie that basically repeats another movie from the same franchise, safe bet, but it can feel frustrating to see te resemblance."
 },
 {
   "review": "The Force Awakens is a disappointing film that offers nothing new to the Star Wars franchise. In fact, it simply signals the end of what Star Wars was and the start of something else that is not Star Wars. It is a rehash of old plot lines and characters, with a protagonist who undergoes no meaningful character arc.\n\nThe film is visually stunning, with some truly breathtaking special effects. However, the story is unoriginal, predictable and clearly copying previous events in Star Wars. The plot is essentially a retread of the original Star Wars film, with Rey filling the role of Luke Skywalker and Kylo Ren filling the role of Darth Vader. It is essentially nothing new, with a character that does not grow like Luke does. \n\nRey is also a very bland and uninteresting protagonist. She is immediately good at everything she does, and she undergoes no real character development over the course of the film. \n\nOverall, The Force Awakens is a disappointing film that offers nothing new to the Star Wars franchise. It is a rehash of old plot lines and characters, with a protagonist who undergoes no meaningful character arc."
 },
 {
   "review": "Great movie, I really liked it."
 },
 {
   "review": "As a die-hard Star Wars fan myself, I found this film to be Disney's utmost disappointment. Obviously sets up a terrible trilogy, and is a copy-paste of the worst parts of A New Hope. While the visuals are stellar and characters alright, everything else is just classically Disney Star Wars."
 },
 {
   "review": "I was expecting to see a continuation/expansion/evolution of Star Wars, not re-make of \"A New Hope\" with a Mary Sue and no on-screen combo of Leia, Luke, and Han. And then killing off a legendary and beloved character in such a pathetic, meaningless way....that just shows ignorance of and disrespect for the story, canon, material, and fans. \nhttps://youtu.be/OdpK-bJiDCw"
 },
 {
   "review": "Best of the sequels, I really liked this movie, and it's what got me into Star Wars."
 },
 {
   "review": "A great start to a trilogy, it's a shame how it ended up becoming."
 },
 {
   "review": "At first we felt it was promising. In hindsight not so much."
 },
 {
   "review": "My initial feelings watching it in 2015 would've rendered this rating a (still generous) half star. Its extra star comes from its impressive visuals and its action scenes are also something to be credited for. Now the very long list of cons. The villains are as unimaginative as they are two-dimensional and bland. The good guys also suffer from this, as well as a plethora of new, equally boring protagonists whose role in the film merely was a forgettable spectacle. The plot is a bloated, flashy, flawed clone copy of Episode IV, and you need not even look past the parentless soon-to-become Padawan raised on a dune planet with a knack for flying and droids to see that. Except this time, there's no Jedi mentor! Combine this with a constant intuitive need to fill in a lot of gaps in context, for a story that was far better told almost 40 years prior, and I'm afraid giving this film more than 3/10 seems awfully generous."
 },
 {
   "review": "Opposed to the next two movies in the future it was fun."
 },
 {
   "review": "It wasn't bad.  I'd still recommend it as a standalone movie, but it did underwhelm when I first saw it on opening night.  Rewatching it again after a few years and I don't think my feelings have changed - it was Disney playing it safe with the IP and practically recreating A New Hope beat for beat.  5/10.  There's much better Star Wars media out there to consume, but there's also significantly worse."
 },
 {
   "review": "Sadly killing off our beloved hero's is just a stab in the heart to true fans. Another unreal score as I've seen no one who puts this anywhere near the first three original movies"
 },
 {
   "review": "They had so much potential to make Finn the next Jedi. It would be so cool to see a black former stormtrooper become a hero."
 },
 {
   "review": "The best one out of the 3, unfortunately they wasted such a great character like finn. He needed to be the jedi tbf or both rey and finn."
 },
 {
   "review": "The best Star Wars film of all time"
 },
 {
   "review": "J.J. Abrams actually had a reasonably simple job here, pander to the fans, reintroduce the old characters, establish new characters, introduce new (well, honestly repackaged old) conflicts, but provide very little payoff or justification for any of it. The new characters are exciting (if a little vaguely drawn) and the movie is undeniably entertaining but again, this isn't really something that can stand on its own."
 },
 {
   "review": "Did I seriously need to watch a film that felt like a cheap recreation of Star Wars: Episode IV A New Hope?"
 },
 {
   "review": "From an execution stand point, the performances and visuals were amazing.\n\nFrom a story and continuity stand point, one of the most disappointing sci-fi films I have seen. The fact that it had the Star Wars title was just embarrassing."
 },
 {
   "review": "It's just a shameless rip-off of the original Star Wars movie, right down to the climactic destruction of another Death Star. Rey is Luke. Kylo Ren is Darth Vader. BB-8 is R2-D2. BB-8 is pursued by the Empire for having a map of Luke's home, while R2-D2 had the Death Star plans. Instead of Luke watching Vader kill Obi-Wan, Rey watches Ren kill Han Solo. And then there are the ludicrous aspects, like Rey inexplicably knowing how to use the Jedi mind trick on a Stormtrooper, or being able to wield a lightsaber as expertly as Ren, despite never before having even held one. It's a mostly competently made rip-off, but it's still a rip-off, like almost everything J.J. Abrams has ever done."
 },
 {
   "review": "This movie was not terrible. It had me excited for the future of the star wars franchise (I did not know what the future would hold...). The movie was solid, and did a decent job of setting up the characters for something interesting. The major critique with this movie is that it was pretty much a copy/paste of A New Hope; so it played it too safe with the plot and characters, to the point where it was too much."
 },
 {
   "review": "It's the kind of film that sets the stage for an epic adventure, but ultimately fails to deliver in the end. As a stand alone, I would give this a solid 3.5 stars. It entertains. It generates questions. It leads in a coherent direction, but the subsequent films ruin all the potential. The actors were strong in this one. The mood and music were authentically Star Wars. It \"felt\" like we were about to get a quality story, but, as we all know, that did not happen. Nevertheless, I can watch this film without wanting to break my TV."
 },
 {
   "review": "THIS MOVIE IS GREAT!!"
 },
 {
   "review": "Had great promise, even though Rey is a Mary Sue and snope was a dead herring it had a great energy, excitement, and there was hope that Star Wars thrive.  Pity the sequels after this, sucked so badly."
 },
 {
   "review": "Nice try to makes something new but it backfired and created a trilogy of chaos that hopefully gets deleted from canon"
 },
 {
   "review": "A sequel that does a good job at bringing together new and old characters, but not a great job at setting up a story unique from the Star Wars we've already seen."
 },
 {
   "review": "I had to come to terms with this and be real with what I witnessed.  A lot of good-looking scenes but a waste of the OG 3.  A lot of rehashing which isn't bad but isn't great either.  The best out of the sequel so-called trilogy."
 },
 {
   "review": "Basically an inferior retelling of the original Star Wars (that was it's name then). Nothing new at all. I had hopes even after the prequels but was actually quite disappointed."
 },
 {
   "review": "The director himself, J.J. Abrams, said that if you like the film, you need to have your sanity checked."
 },
 {
   "review": "The first half hour to hour has some promising character building but it ultimately fails to deliver anything but merchandising opportunities."
 },
 {
   "review": "Star Wars: Force Awakens is a terrible reboot that we did not ask for nor need. The characters and casting are terrible, the way they brought back our favorite characters back from the original trilogy was horrendous, etc. Rey is just such a bad character."
 },
 {
   "review": "Star Wars: The Force Awakens is a thrilling return to the beloved galaxy we all know and love. As a lifelong fan of the franchise, I couldn't help but be captivated by the nostalgia and excitement that this film brought to the screen. The film masterfully blends the old with the new, introducing a new generation of characters while paying homage to the iconic ones we've cherished for decades. Daisy Ridley's Rey and John Boyega's Finn shine as charismatic leads, and their chemistry is undeniable. Adam Driver's Kylo Ren adds a compelling layer of complexity to the villainous role, making him more than just a one-dimensional bad guy. The action sequences are nothing short of spectacular, with breathtaking visual effects that bring the battles to life in a way only Star Wars can. The lightsaber duels are particularly thrilling, and the space battles are a feast for the eyes. While \"The Force Awakens\" hits many of the right notes, it also leaves some questions unanswered, which may leave die-hard fans wanting more. Additionally, it sticks closely to the formula of the original trilogy, which, while nostalgic, may feel somewhat safe to some viewers."
 },
 {
   "review": "Good but the laat trilogy is less"
 },
 {
   "review": "Good action and a charming cast. But the plot is painfully unoriginal and it is overall a wasted opportunity. Han Solo's end was extremely unemotional, Kylo Ren is a bit of a turd, Rey's lines are annoying and the world building is non-existant. Bit lazy there Disney!"
 },
 {
   "review": "I'm not that old, but I think I can safely say this was probably the most anticipated film of all time. If you're coming to get some original trilogy nostalgia, while still getting an entertaining and intriguing movie, you'll get what you came for. Unfortunately, the very nature of the plot in The Force Awakens has the movie leaning heavily on future installments, and we all know how that went. This takes away a lot of the value in rewatchability, and now the movie stands as a monument of what could have been."
 },
 {
   "review": "This had potential, I understand the high scores given that its the return of Star Wars and continuing the Skywalker Saga. Thats a big chunk as to why it did so well at the box office. Other then that, it left maybe some wiggle room for the other films to make it good. Now that we have a bigger view of whats going on. Terrible movie. Disney tried to make something outside of George Lucas's vision and failed miserably. This is not Star Wars. This is a bastardization of what Star Wars was. Will not be sharing this with my children."
 },
 {
   "review": "We should had two great sequels from this film we will never see, hyped up and really  felt like a return but Trilogy just to end up DEAD franchise. Shame"
 },
 {
   "review": "If this were not a blatant plagiarism of A New Hope, The Force Awakens would be a great movie. Instead, it plays as its predecessor with updated faces and effects."
 },
 {
   "review": "Definitely thought it was a solid return for Star Wars, but this doesn't even come close to the original trilogy."
 },
 {
   "review": "Amazing! Too bad the follow ups aren't tho"
 },
 {
   "review": "It was ok the ending was so stupid had a whole bunch of plot holes like was finn sanitation yet fighting on that raid why does he act like hes from earth how can rey with no training take on a skywalker also Kylo ren and finn should both be dead since a lightsaber litterally went right through them what a wast of good actors"
 },
 {
   "review": "One of the best films in the Star Wars saga, which honors all the great legacy of the franchise. Incredible script and direction."
 },
 {
   "review": "A legendary saga returns! Ever since RETURN OF THE JEDI, many people have waited to see a brand new story come alive in a galaxy far, far away, and I have some fantastic news: we've got one, and it's an absolute blast! STAR WARS: THE FORCE AWAKENS brings back familiar favorites and brings back the classic sci-fi action and excitement in full force, while bringing lots of fantastic new characters into the fight."
 },
 {
   "review": "Good movie, the best of the sequels. Loved the introduction of the first order and loved Finn. 5.1/10"
 },
 {
   "review": "Disney doesn't understand cinema anymore."
 },
 {
   "review": "It's good, but I think the reason for that is it's basically A New Hope. Watch A New Hope and The Force Awakens directly afterwards and I think you'll understand what I'm talking about."
 },
 {
   "review": "Not going to lie, I fell asleep more than once."
 },
 {
   "review": "Another great addition to the Skywalker saga, you can only wish the other two sequels were as good as this one."
 },
 {
   "review": "I really enjoyed the movie but it almost seemed to parallel the original in too many ways."
 },
 {
   "review": "This movie was enjoyable but it was very safe for a Star Wars movie. I liked it, but it could have been so much more. It just feels like a modern repeat of a New Hope, but not a good."
 },
 {
   "review": "The Force Awakens cleverly blends nostalgia with fresh elements, introducing a new generation of characters and reigniting the spirit of the original trilogy, resulting in an exciting and visually stunning entry that captivates audiences old and new."
 },
 {
   "review": "if i could give this movie a one, i would. this movie is so horrible i was yawning and get mad the whole time. this character named kylo ren is absolutely horrible and annoying to even look at, made the movie 100x worse and barks at the others 24/7. i felt like i was watching secret life of pets instead of star wars 7. DONT WATCH THIS MOVIE IF UR LOOKING FOR SOMETHING GOOD TO WATCH BECAUSE THIS IS THE COMPLETE OPPOSITE. KYLO NEEDS TO BE HUMBLED AND OFF THE SCREEN ( preferably with a belt ). i don't recommend at all."
 },
 {
   "review": "It was fine by far best of the trilogy"
 },
 {
   "review": "I'm not going to let hind sight change my rating, this is an enjoyable movie.  It does play it safe with the story but is executed well.  It's more difficult to recommend now because of how disappointing it's sequels were but if you haven't seen this yet and want an enjoyable action/adventure movie, this is a good time."
 },
 {
   "review": "This isn't a must watch. I enjoyed it but I understand why people wouldn't. I remember joking about how much like A New Hope this film is when it released but WOW it really did copy the trench run and then the bit from Return of the Jedi where Lando flies into the Death Star"
 },
 {
   "review": "This was the start of something great.  JJ Abrams did a wonderful job creating a new and original film while paying homage to the prequels and at the same time laying bread crumbs and twists for future episodes 8 and 9.   You can honestly tell Abrams had creative control and this movie wasn't tarnished by the mouse of mouse.  The classic Star Wars humor in this movie was there, along with the usual space adventure stuff and unfortunately this movie was the highlight of the new trilogy.   This trilogy felt rushed and unfinished after episode 7.  Something I really do not like are the lightsaber duels in the new trilogy.  All the lightsaber duels melt the colors together and it looks like a video game… the reflections and red + blue sabers= purple just looks corny. Not much else to say… it's a bummer to think what could have been…"
 },
 {
   "review": "And Star Wars is back in action! Although not the best, this film is definitely past the halfway point of my favorite Star Wars movies. Trust me, that's an accomplishment. Harrison Ford, Daisy Ridley, John Boyega, and Adam Driver all did exceptional, and the storyline was great! Overall, a great film"
 },
 {
   "review": "Fantastic directing, excellent actors, and it has the magic  that can be compared with the Original Trilogy. The story copies too much from Episode 4 but it's a very well executed movie. It's such a shame Episode 8 and 9 are not on par with Episode 7."
 },
 {
   "review": "Action was great. So was Rey, for the first half an hour or so. Forgettable characters, forgettable plot, the first shot in the foot of a whole magazine of shitty disney flicks."
 },
 {
   "review": "The beginning of the end of star wars."
 },
 {
   "review": "After Waiting for Godot ...  Waiting for Luke."
 },
 {
   "review": "I originally really liked this movie. Sure it copied some things from previous Star Wars movies and I get the complaints people had with it, but it had a lot of original stuff too and took new characters in interesting new directions (mainly Rey and Kylo, although in my view Daisy Ridley is a great actress and Adam Driver isn't, very expressionless and stale). This movie made me have high hopes for the new triology...and then the Last Jedi came out (ugh)...and then Rise of Skywalker (UGH).\n\nThis movie would've remained good/better if it led to something better, but unfortunately it did not and that's why I can no longer like it as much... if I watch this movie again I just know it's leading to two movies that are absolute atrocities to the Star Wars franchise. I give it credit for being good for quite a few things when it came out and was good fun, but unfortunately the Disney Sequel trilogy is too irredeemable for me at this point. It's quite sad really..."
 },
 {
   "review": "An absolute insult to star wars."
 },
 {
   "review": "It is a very generic star wars movie because of the fact that it's just a new hope with ray inread of luke."
 },
 {
   "review": "A poor rehash of a great film."
 },
 {
   "review": "It’s like a there was a well written script and they said “nah let’s do the opposite!”"
 },
 {
   "review": "I’m an Original Trilogy guy and I loved it. I’m so happy to have more Star Wars movies. Harrison Ford as Han Solo, I mean what else can you ask for? The scene where Han & Chewie are in the Millennium Falcon and Han says “Chewie we’re Home” I cried like a little kid."
 },
 {
   "review": "A very very well made remake of a new hope Nothing more, nothing less. I was hoping to see some brand new ground being covered after the epic final moments of the return of the Jedi, but no we get a complete re tread. It was a good movie but I wanted something new. It didn't even reunite all of our original hero's together which is very sad."
 },
 {
   "review": "Bad… very very bad! I feel bad for the kids who have to grow up with this as their Star Wars"
 },
 {
   "review": "Disappointing very very disappointing"
 },
 {
   "review": "This was my first introduction into the star wars universe and it still holds up pretty well. While yes it's true that it was basically the original trilogy again even bringing back the original cast it was still different enough. honestly a great watch and would recommend but it still is a new hope and the empire strikes back."
 },
 {
   "review": "Not necessary for the plot, bad light Saber effects, repeat of episode 4 and 6"
 },
 {
   "review": "No Darth Vader so don't watch"
 },
 {
   "review": "I really liked this movie. I get it's a lot like A New Hope but after the chaotic mess the prequels were at times, it's good to come back to something that resembled the Star Wars universe we fell in love with. Diversity in casting & characters is a welcome change as well."
 } 
]